[{"_id": {"$oid": "66e1d980773649a0169bc69b"}, "title": "Fullstack JavaScript Developer", "description": "Join an innovative start-up on the cutting edge of Augmented Reality (AR), Artificial Intelligence (AI), and Machine Learning (ML) technologies. Their mission is to transform and enhance safety within an Engineering Maintenance & Repair environment. Following the success of a prototype being developed and securing significant grants and funding, they are now building a high-quality team to develop the products further.\nCollaborating with key partners in the Maintenance, Repair, and Operations industry, they have a real opportunity to create solutions that significantly improve efficiency and compliance for Engineers.\n\nThe Role and Responsibilities:\nDesign, develop and maintain high-quality customer portal system with controlled data access\nProvide expert advice on customer portal development, including creating roadmaps, refining functionality, enhancing user interactions, and improving safety protocols\nWork closely with industry partners to gather requirements and feedback, ensuring the product meets their needs\nEngage in the full software development lifecycle, including planning, coding, testing, and deployment\nCollaborate with AI and ML Engineers to integrate intelligent features into the customer portal\n\nThe Person:\nWe are seeking a talented Software Developer with a solid JavaScript experience who will be involved in the complete software development lifecycle, building an advanced customer portal with controlled data access from the ground up. You will offer strategic guidance throughout the development process, including planning, creating roadmaps, and enhancing functionality and safety, to ensure the portal effectively meets business needs.\nAs part of a fast-growing start-up, you will have the opportunity to make a substantial impact on the product's success and work closely with industry partners.\nA minimum of 3 years of full stack JavaScript development experience, including expertise in web development\nMultiple examples of developing and delivering customer portals\nExperience with technologies including HTML, CSS, as well as version control systems like Git, GitHub and GitLab, frameworks and libraries such as Vue.js, React.js, and Angular etc.\nNode JS experience for backend development\nGood understanding of UI/UX principles to design intuitive interfaces that allow users to easily access data and interact with features\nEnthusiasm for AR technology and experience working in an Agile environment\n", "requirements": ["Html", "JavaScript", "React", "Node", "Express", "Git", "GitHub", "UI/UX"], "experience": "Senior Level", "jobType": "Full-Time", "locationType": "On-Site", "industry": "IT", "externalLink": null, "location": "London", "salary": "64998", "company": {"$oid": "66e1d7c0773649a0169bc679"}, "latitude": 51.5073, "longitude": -0.127647, "savedBy": [{"$oid": "6809316ff8944c578fc64dca"}], "viewCount": 0, "applications": [{"application": {"$oid": "66e1dff4773649a0169bcd26"}, "user": {"$oid": "66e1ced7773649a0169bc31e"}, "_id": {"$oid": "66e1dff4773649a0169bcd28"}}], "createdAt": {"$date": "2024-09-11T17:55:12.431Z"}, "updatedAt": {"$date": "2025-04-23T18:55:44.243Z"}, "__v": 2, "rank": 1, "similarity_score": 0.24672364710677777}]